export interface Achievement {
  title: string;
  description?: string;
}

export const achievements: Achievement[] = [
  {
    title: "Победители конкурса «УМНИК»",
    description: "Фонда содействия инновациям",
  },
  {
    title:
      "Диплом Международной конференции «Перспективы развития фундаментальных наук»",
  },
  {
    title: "Победители акселератора «Стартап-полигон III»",
    description:
      "Томского государственного университета систем управления и радиоэлектроники",
  },
  {
    title: "Резиденты межвузовского студенческого бизнес-инкубатора «Дружба»",
  },
];
