export interface ReviewBlock {
  id: number;
  text: string;
}

export const title = "Роман Тютев, врач психотерапевт, к.м.н.";

export const reviewBlocks: ReviewBlock[] = [
  {
    id: 1,
    text: `Каждый человек пользуется обыденными вещами. Посуда для еды, транспорт для перемещения, кровать для сна, и одеяло для тепла и комфорта. Но сейчас Одеяло - это ещё и приложение. Для чего же оно?

Данное приложение разработано психологами и реализовано программистами для оказания поддержки и психологической помощи тем, кто осознает это и нуждается в ней. В приложении реализованы базовые подходы современной КПТ, хорошо зарекомендовавшей себя в работе с различными психологическими проблемами, в том числе тревогой и депрессией.`,
  },
  {
    id: 2,
    text: `Данное приложение не может заменить полноценную консультацию с психологом, но может стать хорошим дополнением к такой работе и способом самопомощи в трудных психологических ситуациях. Особенно радует, что приложение развивается и предлагает все новые варианты работы.

Так зачем же нужно одеяло? Для тепла и комфорта. В том числе - душевного.`,
  },
];
