"use client";

import { Text } from "@odeyalo/uikit";
import { type FC } from "react";
import { FEEDBACK_EMAIL } from "./constants";
import styles from "./styles.module.scss";

export const UserAgreement: FC = () => {
  return (
    <div className={styles.modalContainer}>
      <Text
        variant="body-xl-bold"
        as={"h2"}
      >
        1. Общие положения
      </Text>
      <Text
        variant="body-m"
        as={"p"}
      >
        1.1. Настоящее Пользовательское соглашение (далее — «Соглашение») и
        Политика конфиденциальности (далее — «Политика») регулируют отношения
        между Пользователем и Командой приложения «Одеяло» (далее —
        «Приложение»).
      </Text>
      <Text
        variant="body-m"
        as={"p"}
      >
        1.2. Использование Приложения означает безоговорочное согласие
        Пользователя с условиями Соглашения и Политики. Если Пользователь не
        согласен с условиями, он обязан прекратить использование Приложения.
      </Text>
      <Text
        variant="body-m"
        as={"p"}
      >
        1.3. Приложение предоставляет доступ к:
      </Text>
      <ul>
        <Text
          variant="body-m"
          as={"li"}
        >
          психологическим тестам;
        </Text>
        <Text
          variant="body-m"
          as={"li"}
        >
          практическим упражнениям;
        </Text>
        <Text
          variant="body-m"
          as={"li"}
        >
          теоретическим материалам по психологии.
        </Text>
      </ul>
      <Text
        as={"h2"}
        variant="body-xl-bold"
      >
        2. Права и обязанности сторон
      </Text>
      <Text
        as={"h3"}
        variant="body-m-bold"
      >
        2.1. Обязанности Пользователя:
      </Text>
      <ul>
        <Text as={"li"}>
          использовать Приложение исключительно в личных некоммерческих целях;
        </Text>
        <Text as={"li"}>не передавать свои учётные данные третьим лицам;</Text>
        <Text as={"li"}>
          не пытаться взломать систему или нарушить её работу;
        </Text>
        <Text as={"li"}>
          предоставлять достоверную информацию при регистрации;
        </Text>
        <Text as={"li"}>
          не размещать контент, нарушающий законодательство или права третьих
          лиц.
        </Text>
      </ul>
      <Text
        as={"h3"}
        variant="body-m-bold"
      >
        2.2. Права Пользователя:
      </Text>
      <ul>
        <Text as={"li"}>получать доступ к функциональности Приложения;</Text>
        <Text as={"li"}>запросить удаление своих персональных данных;</Text>
        <Text as={"li"}>редактировать личные данные в Приложении;</Text>
        <Text as={"li"}>
          обращаться в службу поддержки по вопросам работы Приложения.
        </Text>
      </ul>
      <Text
        as={"h3"}
        variant="body-m-bold"
      >
        2.3. Обязанности Команды Приложения:
      </Text>
      <ul>
        <Text as={"li"}>обеспечивать работоспособность Приложения;</Text>
        <Text as={"li"}>защищать персональные данные Пользователя;</Text>
        <Text as={"li"}>
          своевременно информировать о изменениях в Соглашении и Политике;
        </Text>
        <Text as={"li"}>
          обрабатывать обращения Пользователей в установленные сроки.
        </Text>
      </ul>
      <Text
        as={"h2"}
        variant="body-xl-bold"
      >
        3. Персональные данные и конфиденциальность
      </Text>
      <Text
        as={"h3"}
        variant="body-m-bold"
      >
        3.1. Собираемые данные:
      </Text>
      <ul>
        <Text as={"li"}>
          регистрационные данные (электронная почта, имя, дата рождения, пол,
          телефонный номер);
        </Text>
        <Text as={"li"}>
          данные об использовании Приложения (история результатов тестов,
          прогресс упражнений);
        </Text>
        <Text as={"li"}>
          технические данные устройства (тип устройства, версия ОС, IP‑адрес);
        </Text>
        <Text as={"li"}>
          добровольные данные, предоставленные Пользователем в форме обратной
          связи или обращениях.
        </Text>
      </ul>
      <Text
        as={"h3"}
        variant="body-m-bold"
      >
        3.2. Цели обработки данных:
      </Text>
      <ul>
        <Text as={"li"}>предоставление функциональности Приложения;</Text>
        <Text as={"li"}>улучшение качества сервиса;</Text>
        <Text as={"li"}>техническая поддержка;</Text>
        <Text as={"li"}>дальнейшее развитие приложения</Text>
        <Text as={"li"}>
          статистический анализ для научных целей (в обезличенной форме).
        </Text>
      </ul>
      <Text
        as={"h3"}
        variant="body-m-bold"
      >
        3.3. Защита данных:
      </Text>
      <ul>
        <Text as={"li"}>
          применение современных методов шифрования на облачном сервере;
        </Text>
        <Text as={"li"}>
          ограничение доступа сотрудников к персональным данным;
        </Text>
        <Text as={"li"}>регулярное обновление систем безопасности;</Text>
        <Text as={"li"}>резервное копирование данных.</Text>
      </ul>
      <Text
        as={"h3"}
        variant="body-m-bold"
      >
        3.4. Передача данных третьим лицам:
      </Text>
      <ul>
        <Text as={"li"}>
          не осуществляется без согласия Пользователя, кроме случаев,
          предусмотренных законодательством;
        </Text>
        <Text as={"li"}>
          возможна передача агрегированных (не персональных) данных партнёрам
          для исследований.
        </Text>
      </ul>
      <Text
        as={"h2"}
        variant="body-xl-bold"
      >
        4. Особенности использования психологического контента
      </Text>
      <Text
        as={"h3"}
        variant="body-m-bold"
      >
        4.1. Ограничения ответственности:
      </Text>
      <ul>
        <Text as={"li"}>
          результаты тестов и упражнений носят информационный характер и не
          являются медицинской диагностикой;
        </Text>
        <Text as={"li"}>
          Приложение не заменяет профессиональную психологическую или
          медицинскую помощь;
        </Text>
        <Text as={"li"}>
          Пользователь самостоятельно несёт ответственность за применение
          полученных знаний.
        </Text>
      </ul>
      <Text
        as={"h3"}
        variant="body-m-bold"
      >
        4.2. Рекомендации:
      </Text>
      <ul>
        <Text as={"li"}>
          при наличии серьёзных психологических проблем следует обратиться к
          квалифицированному специалисту-психологу или психотерапевту;
        </Text>
        <Text as={"li"}>
          при подозрении на наличие психических расстройств следует обратиться к
          психотерапевту или психиатору;
        </Text>
        <Text as={"li"}>
          не рекомендуется проходить тесты в состоянии сильного эмоционального
          напряжения;
        </Text>
        <Text as={"li"}>
          результаты тестов не следует использовать для принятия жизненно важных
          решений без консультации со специалистом.
        </Text>
      </ul>
      <Text
        as={"h2"}
        variant="body-xl-bold"
      >
        5. Платные услуги
      </Text>
      <Text
        as={"p"}
        variant="body-m"
      >
        5.1. Некоторые функции Приложения могут быть доступны на платной основе.
      </Text>
      <Text
        as={"p"}
        variant="body-m"
      >
        5.2. Стоимость и условия подписки указываются при оформлении платежа.
      </Text>
      <Text
        as={"p"}
        variant="body-m"
      >
        5.3. Возврат средств осуществляется в соответствии с правилами платёжной
        системы.
      </Text>
      <Text
        as={"h2"}
        variant="body-xl-bold"
      >
        6. Интеллектуальная собственность
      </Text>
      <Text
        as={"p"}
        variant="body-m"
      >
        6.1. Весь контент Приложения (тексты, изображения, алгоритмы) является
        интеллектуальной собственностью Команды.
      </Text>
      <Text
        as={"p"}
        variant="body-m"
      >
        6.2. Запрещается копирование, распространение или коммерческое
        использование контента без письменного разрешения Команды.
      </Text>
      <Text
        as={"h2"}
        variant="body-xl-bold"
      >
        7. Ограничение ответственности
      </Text>
      <Text
        as={"p"}
        variant="body-m"
      >
        7.1. Владелец Приложения не несёт ответственности за:
      </Text>
      <ul>
        <Text as={"li"}>косвенные убытки Пользователя;</Text>
        <Text as={"li"}>неточности в результатах тестов;</Text>
        <Text as={"li"}>
          последствия самостоятельного применения рекомендаций;
        </Text>
        <Text as={"li"}>
          перебои в работе Приложения из‑за внешних факторов.
        </Text>
      </ul>
      <Text
        as={"h2"}
        variant="body-xl-bold"
      >
        8. Изменения в документах
      </Text>
      <Text
        as={"p"}
        variant="body-m"
      >
        8.1. Владелец вправе вносить изменения в Соглашение и Политику.
      </Text>
      <Text
        as={"p"}
        variant="body-m"
      >
        8.2. Пользователи уведомляются об изменениях не менее чем за 14 дней до
        вступления в силу.
      </Text>
      <Text
        as={"p"}
        variant="body-m"
      >
        8.3. Продолжение использования Приложения после изменений означает
        согласие с новой версией.
      </Text>
      <Text
        as={"h2"}
        variant="body-xl-bold"
      >
        9. Прекращение действия соглашения
      </Text>
      <Text
        as={"p"}
        variant="body-m"
      >
        9.1. Соглашение прекращается:
      </Text>
      <ul>
        <Text as={"li"}>по инициативе Пользователя (удаление аккаунта);</Text>
        <Text as={"li"}>при нарушении Пользователем условий Соглашения;</Text>
        <Text as={"li"}>
          по решению Команды при прекращении работы Приложения.
        </Text>
      </ul>
      <Text
        as={"p"}
        variant="body-m"
      >
        9.2. При прекращении действия Соглашения все персональные данные
        удаляются в течение 30 дней, кроме случаев, предусмотренных
        законодательством.
      </Text>
      <Text
        as={"h2"}
        variant="body-xl-bold"
      >
        10. Контакты
      </Text>
      <Text as={"p"}>
        По вопросам использования Приложения, защиты данных или нарушения прав
        обращайтесь:
      </Text>
      <ul>
        <Text as={"li"}>электронная почта: {FEEDBACK_EMAIL};</Text>
        <Text as={"li"}>форма обратной связи в Приложении.</Text>
      </ul>
    </div>
  );
};
